<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'tool_mergeusers', language 'uk', version '3.11'.
 *
 * @package     tool_mergeusers
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['choose_users'] = 'Вибір користувачів для злиття';
$string['clear_selection'] = 'Очистити поточний вибір користувача';
$string['cligathering:description'] = 'Задайте пари ID користувачів для перенесення даних першого користувача до второго. Перший користувач з ID (fromid) «загубить» всі свои дані і будет переміщені до второго (toid). Користувач «toid» будет містити дані обох користувачів.';
$string['cligathering:fromid'] = 'ID користувача-джерела (fromid):';
$string['cligathering:stopping'] = 'Для зупинки злиття, скористайтеся сполученням клавіш Ctrl+C або введіть -1 у поле fromid або toid.';
$string['cligathering:toid'] = 'ID користувача, який приймає (toid):';
$string['dbko_no_transactions'] = '<strong>Злиття не вдалояся!</strong> <br/>Ваша система управління базою даних не підтримує транзакції. Тому вашу базу даних<strong>було змінено</strong>. Статус вашої бази даних може бути невідповідним.<br/>Перегляньте журнал злиття та повідомте про помилку розробників модуля. Ви отримаєте рішення за короткий час. Після оновлення модуля до останньої версії, який буде включати рішення цієї проблеми, повторіть дію злиття, щоб завершити її з успіхом.';
$string['dbko_transactions'] = '<strong>Злиття не вдалося!</strong> <br/>Ваша система управления базами даних підтримує транзакції. Тому, всю поточну транзакцію було скасовано і <strong>зміни у вашу базу даних не було внесено</strong>.';
$string['dbok'] = 'Злиття пройло успішно';
$string['deleted'] = 'Користувача з  ID {$a} видалено';
$string['error_return'] = 'Повернутися до форми пошуку';
$string['errorsameuser'] = 'Спроба злиття користувача самого з собою';
$string['errortransactionsonly'] = 'Помика:  необхідні транзакції, але ваш тип бази даних {$a} їх не підтримує. Якщо потрібно, ви маєте можливість дозволити злиття користувачів без транзакцій. Будь ласка, перегляньте параметри модуля, для того щоб задати їх правильно.';
$string['eventusermergedfailure'] = 'Злиття не вдалося';
$string['eventusermergedsuccess'] = 'Злиття відбулося';
$string['excluded_exceptions'] = 'Прибрати з виключень';
$string['excluded_exceptions_desc'] = 'Виходячи з досвіду, всі ці таблиці бази даних повинні бути виключені з процесу злиття. Подробиці описані в файлі README. <br> Тому, для того щоб модуль поводився за замовчуванням, вам необхідно вибрати \'{$a}\'  для виключення всіх цих таблиць з процесу злиття (рекомендується). <br> Якщо хочете, ви можете виключити будь-які з цих таблиць і включити їх в процес злиття (не рекомендується).';
$string['finishtime'] = 'Злиття завершилось об {$a}';
$string['form_description'] = '<p>Ви можете тут шукати користувачів, якщо не знаєте логін користувача або його ID. В іншому випадку ви можете розгорнути форму і ввести інформацію безпосередньо. Будь ласка, подивіться допомогу про поля для отримання більш докладної інформації</p>';
$string['form_header'] = 'Пошу користувачів для злиття';
$string['header'] = 'Злиття двох користувачів в один обліковий запис';
$string['header_help'] = '<p>Задані користувач, який видаляється і користувач який зберігається, ця операція перенесе дані, що зв\'язані з першим користувачем, до другого користувача. Зверніть увагу на те, що обидва користувача вже повинні існувати і жоден з облікових записів фактично не будет видело. Видалення повинно бути зроблено вручну администратором.</p> <p><strong>Робіть це тільки в тому випадку, якщо ви точно впевнені, що саме ви робите, так як скасувати цю дію неможливо!</strong></p>';
$string['into'] = 'в';
$string['invalid_option'] = 'Недійсна опція форми';
$string['invaliduser'] = 'Помилковий користувач';
$string['logid'] = 'Для подальшої роботи, ці результати записано до журналу з ID {$a}.';
$string['logko'] = 'Виникла помилка:';
$string['loglist'] = 'Всі ці записи — виконані дії зі злиття, показана успішність їх виконання:';
$string['logok'] = 'Записи, які були направлені до бази даних:';
$string['mergeusers'] = 'Злиття облікових записів користувачів';
$string['mergeusers:mergeusers'] = 'Злиття облікових записів користувачів';
$string['mergeusers:view'] = 'Злиття облікових записів користувачів';
$string['mergeusers_confirm'] = 'Після підтвердження процес злиття почнеться.<br /><strong>Цей процес не буде зворотнім!</strong>Ви впевнені, що хочете продовжити?';
$string['mergeusersadvanced'] = '<strong>Призначення користувача для отримання</strong>';
$string['mergeusersadvanced_help'] = 'Тут ви можете ввести у нижче розташованіполя, якщо ви точно знаєте, яких користувачів потрібно об\'єднати.<br /><br />Натисніть кнопку "Пошук", щоб перевірити / підтвердити, що введені дані насправді є потрібними користувачами.';
$string['merging'] = 'Здіснено злиття';
$string['newuser'] = 'Користувач, що залишається';
$string['newuserid'] = 'Індекс ID користува, що зберігається';
$string['newuseridonlog'] = 'Користувач, що залишається';
$string['no_saveselection'] = 'Ви не обрали старого або нового користувача.';
$string['nologs'] = 'Записи про злиття в журналі відсутні. Добре вам!';
$string['olduser'] = 'Користувач для видалення';
$string['olduserid'] = 'Індекс ID користувача для видалення';
$string['olduseridonlog'] = 'Користувача видалено';
$string['pluginname'] = 'Злиття коритстувачів';
$string['privacy:metadata'] = 'Модуль Злиття користувачів не зберігає жодних персональних даних.';
$string['qa_action_delete_fromid'] = 'Зберігати спроби нового користувача';
$string['qa_action_delete_toid'] = 'Зберігати спроби старого користувача';
$string['qa_action_remain'] = 'Нічого не робити: не виконувати злиття і не видаляти';
$string['qa_action_remain_log'] = 'Дані користувача з таблиці <strong>{$a}</strong> не були оновлені.';
$string['qa_action_renumber'] = 'Виконувати злиття спроб обох користувачів і перенумеровувати';
$string['qa_chosen_action'] = 'Обраний варіант для спроб в тестах: {$a}.';
$string['qa_grades'] = 'Перераховані оцінки для тестів: {$a}.';
$string['quizattemptsaction'] = 'Як діяти з оцінками з тестів';
$string['quizattemptsaction_desc'] = 'При злитті спроб в тестах можливі три випадки:<ol> <li>Спроби в тестах є тільки у старого користувача. Всі спроби будуть перенесені так, якщо б вони були зроблені новим користувачем. </li> <li>Спроби в тестах є тільки у нового користувача. Все коректно і нічого не робиться.</li> <li>У обох користувачів є спроби в одному і тому ж тесті. <strong>Ви повинні вибрати, що робити в разі такого конфлікту</strong>. Вам необхідно вибрати одну з таких дій:  <ul> <li><strong>{$a->renumber}</strong>. Спроби старого користувача будуть об\'єднані зі спробами нового користувача і пронумеровані, виходячи з часу початку кожної спроби.</li> <li><strong>{$a->delete_fromid}</strong>. Спроби старого користувача будуть видалені. Спроби нового користувача збережуться, оскільки ця настройка вважає їх найбільш важливими. </li> <li><strong>{$a->delete_toid}</strong>.Спроби нового користувача будуть видалені. Спроби старого користувача збережуться, оскільки це налаштування вважає їх найбільш важливими.</li> <li><strong>{$a->remain}</strong> (попередньо встановлено). Спроби не будуть ні об\'єднані, ні видалені, залишившись закріпленими за тим користувачем, який їх виконав. Це найбільш безпечне дія, але злиття користувачів з A в Б або з Б в А може дати різні оцінки за тести. </li> </ul> </li> </ol>';
$string['results'] = 'Резульатаи злиття та журнал';
$string['review_users'] = 'Підтвердіть користувачів для злиття';
$string['saveselection_submit'] = 'Зберегти позначених';
$string['searchuser'] = 'Пошук за користувачем';
$string['searchuser_help'] = 'Для пошуку потенційних користувачів введіть ім’я користувача, ім’я, прізвище, електронну адресу або ідендекс користувача (id ) . Ви також можете вказати, якщо ви хочете шукати лише певне поле.';
$string['starttime'] = 'Злиття розпочалося об {$a}';
$string['suspenduser_setting'] = 'Призупинити старого користувача';
$string['suspenduser_setting_desc'] = 'При включеному параметрі старий користувач буде автоматично заблокований після успішного завершення процесу злиття і він не зможе увійти в Moodle (рекомендується). Якщо параметр відключений, то старий користувач залишиться активним. В обох випадках дані, пов\'язані зі старим користувачем, в ньому не будуть збережені.';
$string['tableko'] = 'Таблиця {$a} : оновлена НІ';
$string['tableok'] = 'Таблиця {$a} : оновлена Так';
$string['tableskipped'] = 'З метою безпеки і протоколювання ми пропускаємо<strong>{$a}</strong>. <br />Щоб видалити ці записи, видаліть старого користувача після успішного завершення роботи цього сценарію.';
$string['timetaken'] = 'Злиття тривало {$a} секунд';
$string['transactions_not_supported'] = 'До відома, ваша база даних <strong>не підтримує транзакції</strong>.';
$string['transactions_setting'] = 'Дозволені лише транзакції';
$string['transactions_setting_desc'] = 'При включеному параметрі злиття користувачів не буде працювати на базах даних, які НЕ підтримують транзакції (рекомендується). Включення необхідно, щоб бути впевненим, що ваша база даних залишиться цілісною в разі виникнення помилки при злитті. <br />Якщо параметр відключений, то ви завжди зможете запустити дії щодо злиття. У разі помилок, журнал злиття покаже, в чому була проблема. Відправлення протоколу розробникам модуля в найкоротший час дасть вам дії для вирішення проблеми.<br />Крім того, таблиці ядра Moodle та деякі модулі сторонніх розробників вже враховуються цим модулем. Якщо у вашій установці Moodle немає модулів сторонніх розробників, ви можете спокійно запускати цей модуль незалежно від значення цього параметра.';
$string['transactions_supported'] = 'До відома, ваша база даних<strong>підтримує транзакції</strong>.';
$string['uniquekeynewidtomaintain'] = 'Зберігти дані нового користувача';
$string['uniquekeynewidtomaintain_desc'] = 'У разі конфлікту, наприклад, коли стовпець, пов’язаний з user.id, є унікальним ключем, цей модуль зберігатиме дані нового користувача (за замовчуванням).Це також означає, що дані старого користувача видаляються для збереження щильності. Інакше, якщо зняти цю опцію, дані старого користувача зберігатимуться.';
$string['usermergingheader'] = '&laquo;{$a->username}&raquo; (user ID = {$a->id})';
$string['userreviewtable_legend'] = '<b>Перегляд користувачів до злиття</b>';
$string['userselecttable_legend'] = '<b>Виберіть користувачів для злиття</b>';
$string['viewlog'] = 'Переглянути журнал злиття';
$string['wronglogid'] = 'Запис у журналі, про який ви запитуєте не існує.';
